In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("parks.csv", index_col = ["Park Code"])

In [3]:
data.head(3)

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [10]:
data.iloc[2]

park_name    Badlands National Park
state                            SD
acres                        242756
latitude                      43.75
longitude                    -102.5
Name: BADL, dtype: object

In [11]:
data.loc['BADL']

park_name    Badlands National Park
state                            SD
acres                        242756
latitude                      43.75
longitude                    -102.5
Name: BADL, dtype: object

In [19]:
data.loc[['BADL', 'ARCH', 'ACAD']]

                        park_name state   acres  latitude  longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

In [20]:
data.iloc[[ 2, 1, 0 ]]

                        park_name state   acres  latitude  longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

In [21]:
data[:3]

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [22]:
data['state'].head(3)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: state, dtype: object

In [23]:
data.state.head(3)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: state, dtype: object

In [24]:
data.Park Code

SyntaxError: invalid syntax (<ipython-input-24-d718680f14fe>, line 1)

In [28]:
data.columns = [ col.replace(' ', '_').lower() for col in data.columns ]
print(data.columns)

Index(['park_name', 'state', 'acres', 'latitude', 'longitude'], dtype='object')

In [29]:
data[[ 'state', 'acres' ]][:3]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

In [30]:
data.state.iloc[2]

'SD'

In [31]:
data.state.iloc[[2]]

Park Code
BADL    SD
Name: state, dtype: object

In [32]:
data[data.state == 'UT']

                            park_name state   acres  latitude  longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93
CARE       Capitol Reef National Park    UT  241904     38.20    -111.17
ZION               Zion National Park    UT  146598     37.30    -113.05

In [33]:
data[ (data.latitude > 60) | (data.acres > 10 ** 6)].head(3)

,park_name,state,acres,latitude,longitude
Park Code,,,,,
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
DEVA,Death Valley National Park,"CA, NV",4740912,36.24,-116.82
EVER,Everglades National Park,FL,1508538,25.32,-80.93

In [34]:
data[ data['park_name'].str.split().apply(lambda x: len(x) == 3)].head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50